spec/fixtures/responses/donations.json

{
  "donations": [
    {
      "id": 1,
      "site_id": 6,
      "created_at": "2016-03-30T14:41:48Z",
      "updated_at": "2016-03-30T14:46:25Z",
      "first_name": "John",
      "last_name": "Doe",
      "anonymous": false,
      "contact_details_type": "visible",
      "email": "john.doe@kentaa.nl",
      "newsletter": false,
      "device_type": "desktop",
      "locale": "nl",
      "frequency_type": "oneoff",
      "currency": "EUR",
      "amount": "15.0",
      "transaction_costs": "0.4",
      "start_donation": false,
      "registration_fee": true,
      "registration_fee_amount": "10.0",
      "total_amount": "25.4",
      "receivable_amount": "24.0",
      "countable": true,
      "invoicenumber": "T2016.0001.0000001",
      "payment_method": "ideal",
      "payment_status": "paid",
      "payment_status_at": "2016-03-30T14:46:25Z",
      "transaction_id": "B5C7B7BCAF1ADF6E2032C7CF56969876",
      "payment_id": "116D10DD544ECD1E2D77762C5C3E6D61",
      "payment_description": "Donatie Demo",
      "target_url": "https://demo1.kentaa.nl/",
      "questions": [
        {
          "id": 1,
          "created_at": "2015-08-26T14:50:16Z",
          "updated_at": "2015-08-26T14:50:20Z",
          "question": "Gender",
          "answer": "male"
        }
      ],
      "reward": {
        "id": 1,
        "type": "SiteReward",
        "title": "Awesome reward",
        "description": "Lorem ipsum",
        "ask_for_address": true
      },
      "address": {
        "address": "Jansbuitensingel 29",
        "street": "Jansbuitensingel",
        "house_number": "29",
        "zipcode": "6811AD",
        "city": "Arnhem",
        "country": "NL"
      }
    }
  ],
  "links": {
    "pages": {
      "last": "https://api.kentaa.nl/v1/donations?page=31&per_page=1",
      "next": "https://api.kentaa.nl/v1/donations?page=2&per_page=1"
    }
  },
  "total_entries": 31,
  "total_pages": 31,
  "per_page": 1,
  "current_page": 1
}
